Revit 2027 API
Pipe.IsPlaceholder Property
 Identifies if the pipe is a placeholder or not.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPlaceholder { get; }
Public ReadOnly Property IsPlaceholder As Boolean
	Get
public:
property bool IsPlaceholder {
	bool get ();
}
member IsPlaceholder : bool with get
Property Value
Boolean
See Also
Reference
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace